Repository: iLeksei/angular_sandbox
Catalog: src/locale/messages.*.xlf
Languages: ru

source: Components
ru: Компоненты

source: Counter
ru: Счетчик

source: Timer
ru: Таймер

source: Dynamic form
ru: Динамическая форма

source: Interaction parent-child
ru: Взаимодействие родитель-ребенок

source: Local var Interaction
ru: Взаимодействие через локальную переменную

source: Interaction via service
ru: Взаимодействие через сервис

source: Interaction via template
ru: Взаимодействие через шаблон

source: Dynamic Components
ru: Динамические компоненты

source: Custom Component (popup)
ru: Кастомный компонент (всплывающее оконка)

source: Container with directive demo
ru: Привер контейнера с директивой

source: Lazy Component
ru: Ленимый компонент

source: Reactive Form Demo
ru: Пример реактивной формы

source: Template-Driven Form Demo
ru: Пример шаблонизатора форм

source: Dynamic Form Demo
ru: Пример динамической формы

source: Http client Demo
ru: Пример Http-клиента
